app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
        <td class="comment-count">
                <span class="tag is-rounded"><%= post.comments.count %> comentarios</span>