app/views/posts/show.html.erb

<strong>------------------------------------</strong>
<% @post.comments.each do |com| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]