app/controllers/comments_controller.rb

INSERT INTO "comments" ("usuario", "comentario", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["usuario", "kjhkjhk"], ["comentario", "jhkljhlk"], ["post_id", 2], ["created_at", "2018-03-19 10:23:23.809804"], ["updated_at", "2018-03-19 10:23:23.809804"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save