app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT  "posts".* FROM "posts" ORDER BY fecha LIMIT $1  [["LIMIT", 1]]

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("titulo", "bajada", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["titulo", "jkjhj"], ["bajada", "jkblkjhlk"], ["body", "ljlhkjhl"], ["created_at", "2018-03-19 08:03:46.364142"], ["updated_at", "2018-03-19 08:03:46.364142"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "bajada" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["bajada", " . "], ["updated_at", "2018-03-19 17:50:24.791494"], ["id", 4]]